console.log('Lesson-1 JS');

//? Створити змінну з іменем age і присвоїти їй значення свого віку.
//?  Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
let age = 14;
console.log(age);

//? Створити змінну з іменем name і присвоїти їй значення свого імені.
//? Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
let name = "Pavlo";
console.log(name);

//? Створити змінну з іменем isStudent і присвоїти їй значення true або false,
//? залежно від того, чи є студентом. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
let isStudent = true;
console.log(isStudent);

//? Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
//? Вивести цей рядок в консоль.

//! Код виконаного завдання
let myString = "Якщо ти щось робиш і в тебе не виходить з першого разу значить ти на правильному шляху. Життя дає нам випробування, які потрбіно подолати не зважаючи на всі труднощі, тому терпи, терпець тебе шліфує!!!";
console.log(myString)

//? Створити змінну з іменем myNumber і присвоїти їй довільне числове значення.
//? Потім присвоїти цій змінній результат додавання до неї числа 10. Вивести значення myNumber в консоль.

//! Код виконаного завдання
let myNumber = 1238;
myNumber += 10;
console.log(myNumber)

//? Створити змінну з іменем myNull і присвоїти їй значення null. Вивести значення цієї змінної в консоль.

//! Код виконаного завдання
let myNull = null;
console.log(myNull)

//? Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача за допомогою prompt().
//? Після введення імені вивести повідомлення привітання з використанням введеного імені.

//! Код виконаного завдання
const yourName = prompt("Будь-ласка введіть своє ім'я");
console.log(yourName);

//? Створити скрипт який виводить спливаюче підтвердження за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

//! Код виконаного завдання
const isComing = confirm('підтвердіть свої дії');
console.log('isComing:', isComing);

//? Створити скрипт який виводить спливаюче попередження за допомогою alert().
//? Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm().
//? Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
//? Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!"

//! Код виконаного завдання
alert("Ця дія не безпечна");
 const isComing1gпав = confirm ("Підтвердіть свої дії")
console.log('isComing:', isComing);
