import"./modulepreload-polyfill-3cfb730f.js";console.log("Lesson-1 JS");//! Код виконаного завдання
let e=14;console.log(e);//! Код виконаного завдання
let n="Pavlo";console.log(n);//! Код виконаного завдання
let s=!0;console.log(s);//! Код виконаного завдання
let g="Якщо ти щось робиш і в тебе не виходить з першого разу значить ти на правильному шляху. Життя дає нам випробування, які потрбіно подолати не зважаючи на всі труднощі, тому терпи, терпець тебе шліфує!!!";console.log(g);//! Код виконаного завдання
let o=1238;o+=10;console.log(o);//! Код виконаного завдання
let t=null;console.log(t);//! Код виконаного завдання
const c=prompt("Будь-ласка введіть своє ім'я");console.log(c);//! Код виконаного завдання
const l=confirm("підтвердіть свої дії");console.log("isComing:",l);//! Код виконаного завдання
alert("Ця дія не безпечна");confirm("Підтвердіть свої дії");console.log("isComing:",l);
