import"./modulepreload-polyfill-3cfb730f.js";//! Приклад-алгоритм приготування кави за допомогою функції "Приготування кави"
//! Стрілкові(cтрілочні) функції
console.warn("Стрілкові(cтрілочні) функції:");function d(o,e,n){return o+e+n}console.log("classicAdd(1, 2, 3);",d(1,2,3));//! 6
console.log(". . .  . . . .  . . . . . . . . . . . . . . . . . . . .");const a=(o,e,n)=>o+e+n;console.log("arrowAdd(10, 20, 30);",a(10,20,30));//! 60
console.log(". . .  . . . .  . . . . . . . . . . . . . . . . . . . .");const u=o=>o+5;console.log("add(10);",u(10));//! 15
console.log(". . .  . . . .  . . . . . . . . . . . . . . . . . . . .");const f=()=>"Привіт!";console.log("greet();",f());//! 15
console.log("-------------------------------------------------------");//! Явне та неявне повернення
//! Явне повернення
console.warn("Явне повернення:");const t=(o,e,n)=>(console.log(o,e,n),o+e+n);console.log("arrowAdd2(100, 200, 300);",t(100,200,300));//! 600
console.log("-------------------------------------------------------");//! Неявне повернення
console.warn("Неявне повернення:");console.log("arrowAdd2(1000, 2000, 3000);",t(1e3,2e3,3e3));//! 6000
console.log("-------------------------------------------------------");//! Псевдомасив arguments
console.warn("Псевдомасив arguments:");const w=(...o)=>{console.log("args:",o)};w(1,2,3);//! args: [1, 2, 3]
console.log("-------------------------------------------------------");console.warn('Приклад функції "Приготування кави":');let l,r,s;//! 1 - функція "Приготування меленої кави"
const i=o=>(l=o,console.log("1️⃣ Мелена кава є?",!!l),l);//! 2 - функція "Приготування окропу (гарячої води)".
const A=o=>(r=o,console.log("2️⃣ Окріп (гаряча вода) є?",!!r),r);//! 3 - функція "Приготування кави"
const g=(o,e,n,c)=>(console.log(o,e),console.log(n),console.log(c),n(o)?c(e)?(s=l+r,s="✅ Кава готова!",s):"Потрібна гаряча вода!":"Потрібна мелена кава!");console.log(g("30 г","250 мл",i,A));console.log(g);console.log("--------------------------------------------");
